Revit 2026 API

# SpaceNumberofPeople Property

---

Get or set the Number of People of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double NumberofPeople { get; set; }
```
```vb
Public Property NumberofPeople As Double
	Get
	Set
```
```cpp
public:
property double NumberofPeople {
	double get ();
	void set (double value);
}
```
```fsharp
member NumberofPeople : float with get, set
```

#### Property Value

Double

This property is used to get or set Number of People of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace